#include<iostream>
using namespace std;


//三目运算符：表达式1 ? 表达式2 ：表达式3;
//如果表达式1的值为真，执行表达式2，并返回表达式2的结果；如果表达式1的值为假，执行表达式3，并返回表达式3的结果。
//和if语句比较，三目运算符优点是短小整洁，缺点是如果用嵌套，结构不清晰

/*if 表达式1
{
	表达式2
}
else
{
	表达式3
}
*/

int main28() {
	//a和b比较，哪个大将其赋值给c
	int a = 10;
	int b = 20;
	int c = 0;

	c = a > b ? a : b; // 如果a > b为真，返回a，；如果a > b为假，返回b。
	cout << "c = " << c << endl;

	//C++中三目运算符返回的是变量,可以继续赋值

	(a > b ? a : b) = 100; //将返回的那个值赋值为100，b大，将b赋值为100

	cout << "a = " << a << endl;
	cout << "b = " << b << endl;

	return 0;
}